Revit 2024 API
FormatOptions.CanUsePlusPrefix Method (ForgeTypeId)
 Checks whether a plus prefix can be displayed for a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool CanUsePlusPrefix(
	ForgeTypeId unitTypeId
)
Visual Basic
Public Shared Function CanUsePlusPrefix ( _
	unitTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool CanUsePlusPrefix(
	ForgeTypeId^ unitTypeId
)
Parameters
unitTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the unit.
Return Value
 True if a plus prefix can be displayed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormatOptions Class
CanUsePlusPrefix Overload
Autodesk.Revit.DB Namespace